CFE_project_builder_1C/DataProcessors/сп_ВыполнениеСценариев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>сп_ВыполнениеСценариев</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.сп_СценарииСборки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Программа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конфигурация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.сп_Конфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогФайл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрерватьВыполнениеКоманд</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КомандыСценария</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическаяКоманда</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокКонфликтов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПолноеИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

CFE_project_builder_1C/DataProcessors/сп_ВыполнениеСценариев/Forms/ФормаЧтенияЛогФайла/Ext/Form/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КопироватьДанныеФормы(Параметры.Ключ, Объект);
	Элементы.РазрешитьMergeConflict.Видимость = Объект.СписокКонфликтов.Количество() > 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "сп_ПрочитатьЛогФайла" Тогда
		
		ПрочитатьЛогФайл();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РазрешитьMergeConflict(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Ключ", Объект);
	
	ОткрытьФорму("Обработка.сп_ВыполнениеСценариев.Форма.ФормаРазрешенияКонфликтов", ПараметрыОткрытия, 
		ЭтаФорма, Новый УникальныйИдентификатор, , , , 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("ПрерватьВыполнениеКоманд", Элементы.ГруппаДекорации.Видимость = Истина);
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПрочитатьЛогФайл() 
	
	ЛогФайл = Новый Файл(Объект.ЛогФайл);
	
	Если Не ЛогФайл.Существует() Тогда
		Возврат;
	КонецЕсли;

	КоличествоСтрок = ДанныеЛогФайла.КоличествоСтрок();
	
	ЧтениеТекста = Новый ЧтениеТекста;
	ЧтениеТекста.Открыть(ЛогФайл.ПолноеИмя, КодировкаТекста.UTF8, , , Ложь);
	
	Пока Истина Цикл
		СтрокаТекста = ЧтениеТекста.ПрочитатьСтроку();
		
		Если КоличествоСтрок > 0 Тогда
			КоличествоСтрок = КоличествоСтрок - 1;
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТекста = Неопределено Тогда
		    Элементы.ГруппаДекорации.Видимость = Истина;
			Прервать;
		ИначеЕсли СтрокаТекста <> Неопределено И СтрНайти(СтрокаТекста, "конец выпонения сценария") <> 0 Тогда 
			ДанныеЛогФайла.ВставитьСтроку(0, СтрокаТекста);
		    Элементы.ГруппаДекорации.Видимость = Ложь;
			Прервать;
		КонецЕсли;
		
		ДанныеЛогФайла.ВставитьСтроку(0, СтрокаТекста);
	КонецЦикла;
	
	ЧтениеТекста.Закрыть();	
	
	// найти файлы с merge conflict
	Объект.СписокКонфликтов.Очистить();

	МассивКонфликтов = сп_ОбщегоНазначенияКлиент.МассивКонфликтов(ДанныеЛогФайла.ПолучитьТекст());

	Для Каждого Конфликт Из МассивКонфликтов Цикл
		НовСтрока = Объект.СписокКонфликтов.Добавить();
		НовСтрока.ПолноеИмяФайла = Конфликт;		
	КонецЦикла;

	Элементы.РазрешитьMergeConflict.Видимость = Объект.СписокКонфликтов.Количество() > 0;
КонецПроцедуры

#КонецОбласти
